

const asyncHandler = (fn) => (req , res , next) => {


 Promise.resolve(fn(req , res , next)).catch(next)   


// fn دي فونشين راوتير بتاعك اللى فية الكود رواتير بتاع راوتير بتاع بيتحط ويبتاسي في داخل فونشين دة


//  Promise.resolve(fn(req , res , next)) بقولوة شغل راوتير دة لو نجح خلاص ومفيش ايرور خلاص خش على رواتير بعدة رواتر ريجستر نجح وبعت الرد خلاص خش بقي ع رواتر لوجين وهكذا 

// catch(next) اظهرلي ايرورر اللى ظاهر في نيكست وابعتهولي في كاتش في اكسبريس دة على طول هيمسك اي ايرورر معروض هنا ويبعتهوة لاكسبريس 

// يعني لو قفشت ايرور وانت بتتنقل الخطوة جاية ابعتوة لكاتش والكاتش يبعتوة لاكسبيريس


// يعني دورهم يمسكوة اي ايرورر موجود في مشروع كلة اي خطأ او اي نجاح رد بدل ما تستخدم تراي والكاتش


// Promise.resolve دي عمليات انتظار بتاخد وقت زاي مثلا الرد او ايرور او لما تيجي تجيب بيانات كل دولت بيرجعوة لاويت واثينك دة الوعد

}







module.exports = asyncHandler










