

const dotenv = require("dotenv")


dotenv.config()


const http = require("http") 

const jwt = require("jsonwebtoken")

const {Server} = require("socket.io")

const connectDB = require("./src/config/db")

connectDB()

const app = require("./src/app")

const port = process.env.PORT || 5000

const Message = require("./src/models/message")

const jwt = require("jsonwebtoken")

const http = require("http") 


const {Server} = require("socket.io")

// الفكرة بدل ما اكتب كدة مرتين وهو بيرجعلي اوبجكيت كبير فمش عايزو يرجعلي اوبجكيت كبير في اكتر من خصائص او اكتر من كي مفتاح اوبجكيت كتير انا عايز حاجة واحدة منها الا وهو سيرفر اللى هوصلوة باكسبريس بتاعي عشان كدة اختصرت وكتبت سيرفر بدل ما اكتب مكتبة نفسها ويرجعلي اوبجكيت كتير انا عايز حاجة واحدة بس كي بص تحتك 

// const socketio = require("socket.io") ده بيرجع لك بص تحتك Object من مكتبة Socket.io

// const Server = socketio.Server

// {
//   Server: class Server {},
//   Socket: class Socket {},
//   other: ... عشان كدة كتبت سيرفر فقط فهمت لان عايز سيرفر مش عايز كل مفاتيح دي انا عايز مفتاح سيرفر اوبجكيت فقط
// }


const server = http.createServer(app) // انا بكريت سيرفر لل اببب انا شغال علية اببب بتاع اكسبريس اللى انا شغال علية عشان بعد كدة اقدر اربطوة بسيرفر بتاع سوكيت بقولوة هنا كريتلي سيرفر لل ابب


const io = new Server(server) // هنا بقي بعد ما كريت سيرفر بتاع اببب ربطوة بسيرفر بتاع سوكيت يعني معناها خد شغلي سيرفر دة عندك على سوكيت وخلي الاتصال مفتوح دايما مابين السيرفر والمتصفح بدون ريفريش ريل تايم وقت حقيقي


// http دي برتوكول موجودة في نودي جيس هنا عبارة عن عملية تواصل مابين السيرفر والمتصفح زاي ما انت وصحبك كدة بتكملوة مع بعض بنفس لغة عشان تفهموة بعض كذلك نفس كلام ينطبق على بروتوكول دة بنستخدمة في كل مواقع لان حبيت تروح تجيب داتا تجيب متصفح تفتح يويتوب او فيسبوك او اي حاجة هتلاقيها قدامك يعني السيرفر والمتصفح متفقين على نفس طلب داتا وشكل بيانات فالاتنين مذاكرين بعض وفاهمين بعض


// HTTP Server دة لما كريت سيرفر 
//      |
//  --------------------------------------------
//                                             |
//   |              |
// Express دة لما ربط سيرفر باكسبريس      Socket.io دة لما ربطت اكسبريس بالوسوكيت مع بعض على نفس بورت ونفس سيرفر   



// بعدها بقي نربط اتصال بالحدث بتاع سوكيت ونعرف من خلالة المستخدم فاتح تطبيق ونميز كل مستخدم بأيدي سوكيت عشان خاطر نحدد مين دخل ع سيرفر ومين متصل ومين بيبعت رسالة لمين كل دة هنعرفة من فونشين اتصال تحتك دة



// احنا بنستخدم سوكيت ايدي عشان نعرف مستخدم فاتح من أنهي جهاز بظبط وكمان دة ايدي عشوائي بيتغير لما مستخدم يعمل ريفريش لكن دورنا هنا بقي نعرف مستخدم عامل اوفلاين ولا اونلاين وعشان نعرف كدة محتاجين نستخدم الايدي بتاعوة متخزن في داتا بيز هنعمل اوبجكيت نخزن فية الايدي بتاع يوسير والايدي بتاع سوكيت عشوائي مع بعض وفي اخر هيتحولوة كمصفوفة ونبعتوة تاني للفروند اند







io.use((socket , next) => {

//  احنا عملنا توكين لسيرفر عشان نحمي سيرفر من الهكر لان ممكن مستخدم خبيث او هكر خبيث ميقدرش يخش يهكر اكسبريس لان فيها توكين لكن ممكن يخش هنا في سوكيت يشوف الشات والايدي بتاع يوسير وكل حاجة وشكرا انت وقعت فلازم الصح تحمي سيرفر تتأكد ان توكين دة صح نفس مستخدم ولا لاء كنوع من انواع الحماية لسيرفر بنستخدموة عشان نبقي عملنا توكين لاكسبريس وتوكين لسوكيت

try{

const token = socket.handshake.auth.token // كلمة سوكيت دي بارميتر بتاعنا معروفة وكلمة هاندتشيك دة خاصية بيلدان في مكتبة سوكيت وكلمة اوس دة خاصية بيليدان في مكتبة سوكيت برضو وكلمة توكين دة اسم مفتاح بيحتوي على يوسير متصل بالسيرفر تلؤتي فية توكين بتاعوة

if(!token){

 throw new Error("user is not found")

}


const decode = jwt.verify(token , process.env.JWT_SECRET) // بنتأكد من يوسير توكين بتاعوة 

socket.user = decode // دة مفتاح هنستخدمة بعد كدة في كل فونيشن عشان نتأكد من يوسير يعني فونشينات بعد كدة عشان كدة اخترعت كلمة اسمها يوسير قولت لبارميتر سوكيت خدة حاجة اسمها يوسير دي بتساوي توكين فكينها وفيها الايدي بتاع مستخدم بتاعنا

next() // هيخش على فونشين بعدك بقي

}

catch(err){
 
 return next(err)  // كلمة نيكست دي يعني معناها اعرضلي ايرورر على طول طبعا معنديش ريسبونيت هنا كبارميتر بستخدم نيكست هي هي بس الفرق دة هنا في سوكيت تاني في اكسبريس

}


})
  
//  {
//    id: "abc123",
//    handshake: {...},
//    emit(){},
//    on(){},
//    user: decode
// } اول ما مستخدم يبدأ يتصل بسوكيت المكتبة سوكيت دي بتشتغل كدة في خلفية يخزنلك كل الاحداث وفونشينات داخل اوبجكيت واحد فقط عشان كدة عرفنا نستخدم ميدل وير بتاعنا في اكتر من فونشين لان كلهم متخزنين داخل اوبجكيت واحد فقط

// socket.user = decode عرفت بقي اخد توكين وابصايها لاي فونشين و اي حدث لان كلهم داخل وابجكيت واحد فقط كل احداث ليها علاقة بسوكيت كلها بتتخزن في اوبجكيت واحد فقط 

/////////////////////////////////////////////////////////////////////////////////////////////////////// 

const onlineUsers = {} ;

io.on("connection" , (socket) => {

 console.log("A user is connected" , socket.id)


 socket.on("userOnline" , (userId) => {

 onlineUsers[userId] = socket.id // هنا بقولوة ان الايدي بتاع يوسير متخزن في داتا بيز بيساوي نفس الايدي بتاع سوكيت بتاع مستخدم الايدي بتاع يوسير دة هيجيلك من فروند لما يشغل حدث يوسير اونلاين دة    
 
 io.emit("checkUserOnline" , Object.keys(onlineUsers)) // هنا بعت متأكد وعرفت مين مستخدم فاتح بظبط عملت حدث وبعتوة لفروند اند وبعتولوة الايدي بتاع مستخدم متخزن عندي والايدي عشوائي بتاع سوكيت بتاعوة وكمان بنعرف فروند اند ان فية مستخدم متصل تلؤتي بسيرفر 


// const onlineUsers = { هنا انا خزنت الايدي بتاع يوسير كمفتاح والقيمة بتاعتها الايدي بتاع سوكيت 
//   "user_99": "abc123xyz",       // "abc123xyz" هو السوكيت آيدي
//   "user_55": "socket_id_777",   // "socket_id_777" هو السوكيت آيدي
// };

// Object.keys(onlineUsers)) هو انا هنا خد كل مفاتيح بتاعتك اللى هو الايدي بتاع مستخدم وخزنهولي في مصفوفة لوحدها بص قبل وبعد 


// [ "user_99", "user_55"] هنا بقي بعد ما قولتلوة هاتلي كل مفاتيح اوبجكيت اللى هو الايدي بتاع يوسير جابهوملي وخزنهملي في مصفوفة لوحدهم فقط مخزنش سوكيت لان سوكيت فاليو مش مفتاح

}) 

/////////////////////////////////////////////////////////////////////////////////////////////////////////////// 

socket.on("joinRoom" , (chatId) => {


socket.join(chatId) // نعرف رقم ايدي غرفة مستخدم فيها راح عليها

// هنا بنعرف الروم اللى هو رايح عليها والروم دي الايدي بتاع محادثة يعني بارميتر بيعود على محادثة اللى هو موديل متخزن عندك الايدي انهي محادثة مستخدم بيستخدموة

// chatId دة الايدي بتاع محادثة سكيما في داتا بيز بتبعتها هنا كبراميتر كان ممكن اسميها كنفرسينش ايدي بس حبيت افصلها عشان منستحوش بنحدد محادثة انهي روم تلؤتي اللى مستخدم فيها

})



///////////////////////////////////////////////////////////////////////////////////////////////////////////////// 

socket.on("sendMessage" , async (data)=> {


const {conversationId, sender, content} = data // فروند اند هيبعتلك قيم دي انت بتسبقلها كبارميتر انت كباك اند تستقبل الايدي بتاع يوسير متخزن في داتا بيز وتستقبل رسالة اللى هيبعتها لمستخدم اخر فأصبح تلؤتي بارميتر دة بقي كدة بص  تحتك

// conversationId = "u2"====>>>>> dataقيمة بارميتر  

// content = "hello" ====>>>>> data قيمة بارميتر



const message = await Message.create({conversationId , sender , content})


io.to(conversationId).emit("newMessage" , message) // بقولوة رسالة دي رايحة للمستخدم الايدي بتاعة متخزن عندك في داتا بيز وشغلي معاها حدث اسمة نيو ماسج يعني رسالة جديد يعني في مستقبل او بعدين المستخدم هيبعت رسالة من وقت لاخر في وقت لاحق يعني 


// انا هنا بخزن رسايل ومحادثات داتا بيز لحظة بلحظة في حالة المستخدم بعت رسالة فورا للمستخدم اخر هنا بقي فوق بقولوة دة رايح للمحادثة كذا انا كدة كدة مخزن اسم يوسير ايدي عندي ورسايل محتاجها ومحادثة مش محتاج هنا اقولوة يوسير ايدي لان هو متخزن عندي في داتا انا محتاج اقولوة لما اشغل حدث نيو ماسج يعني رسالة جديدة ارميها في قلب محادثة سواء بقي باسم شاف رسالة او احمد شاف رسالة انا ماليش دعوة انا في حد بعت رسالة انا دوري ابعت رسالة في محادثة كذا لما حد يبعت رسالة

// بنحدد هنا برضو انهي روم مستخدم فيها في مستقبل بعد كدة لما يبعت رسالة ويرمي رسالة بتاعتة سواء احمد شافها او محمد شافههامهم عرفنا رسالة رايحة فين في انهي محادثة
})


// محتاجين برضو نخزن رسالة لحظة لحظة زاي ما هي بتوصل للمستخدم لحظة بلحظة بحيث نضمن ان رسالة اتخزنت بسرعة في داتا بيز ومخدتش وقت في ثانية مستخدم بعت رسالة لمستخدم اخر المستخدم اخر استلم رسالة فورا في ساعتها لكن نت وقف فأنت ملحقتش تخزن رسالة ساعتها في داتا بيز لان عملية دي بتاخد وقت فالصح تخزن داتا بيز في ساعتها في حالة لو مستخدم بعت رسالة على طول فورا تتخزن في داتا بيز فورا

// مستخدم بعت رسالة والرسالة وصلت لمستخدم اخر بس في خلال ثانية دي نت قطع من عندة ملحقتش تخزن رسالة في داتا بيز اللى انت بعتها عشان كدة الصح تخزن داتا بيز وتبعت رسالة فورا وتخزنها في داتا بيز في ساعتها فورا

// بنخزن محتوي رسالة في ساعتها على طول والمحادثة وكل حاجة في ساعتها وبعدها بنعرف الرسايل مستخدم هيبعتها هتتخزن على طول في سيرفر تلقائي في ثانية مش محتاج ريفريش هتتخزن في داتا بيز تلقائي وبنعرف ايدي بتاع مستخدم وكل حاجة


///////////////////////////////////////////////////////////////////////////////////////////////////////////////

socket.on("typing" , (data)=> {

const {conversationId , userId} = data // دولت جايبن من فرونداند وانا فكيتهم لكدة بص تحتك

// conversationId = "u2"====>>>>> dataقيمة بارميتر  

// userId = "6189" ====>>>>> data قيمة بارميتر

socket.to(conversationId).emit("userTyping" , userId) // معناها ان مستخدم دة بيكتب تلؤتي ويبان للمستخدم تاني ان محمد بدأ يكتب


})

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

socket.on("stopTyping" , (data)=> {


 const {conversationId , userId} = data 
 
 socket.to(conversationId).emit("userStopTyping" , userId)

})
// io.emit() دي لما تكون عايزين تبعت لكل ناس تطبيق حاجة معينة وكلة يعرفها زاي مثلا مستخدم دة اوفلاين كل ناس على تطبيق هتعرف ان مستخدم دة اوفلاين

// socket.emit() دي هتبعت لشخص واحد فقط يعني مين فاتح سوكيت تلؤتي ويبعت رسالة احمد فاتح سوكيت يبعت رسالة لمحمد عشان كدة من خلال سوكيت ايدي استخدمنا سوكيت هنا في كتابة عشان نبين للمستخدم ان احمد هو بيكتب مش انت

// io.to("room") دي بتبعت رسايل او بتبعت حاجات لروم دة فقط لروم واحد فقط مثلا بديك مثال عشان كدة كتبت روم يعني معناها مثلا دة هيبعت رسايل في روم دة بقي اي حد يشوفها برمي كورة في نص محادثة وببعتها للغرفة دي فقط

///////////////////////////////////////////////////////////////////////////////////////////////////////////////


socket.on("disconnect" , ()=> {


 const userId = Object.keys(onlineUsers).find((key)=> {

 return onlineUsers[key]===socket.id // بقولوة حولي اوبجكيت مفاتيح الايدي جواها دي حولها لمصفوفة وامسكلي كل ايدي قارنهولي وشوفوة هل بيساوي السوكيت دة ولا لاء يعني باسم قفل باسم لهو ايدي سوكيت وايدي يوسير بنقارن هنا بقي يوسير ايدي بالايدي سوكيت اللى قفل تلؤتي 

 })   


 delete onlineUsers[userId] // بقولوة لو قافل فعلا امسحوة من اوبجكيت خالص يعني معناها اوفلاين
    
// Object.keys(onlineUsers)  دة كدة اتحولت كمصوفة


io.emit("checkUserOnline" , Object.keys(onlineUsers)) // عشان نعرف مستخدمين ان فية مستخدم قفل يعني مش موجود يعني اتمسح يعني اوفلاين عشان يتحدث في ساعتها ويظهر لمستخدم كدة ان هو قفل في نفس لحظة تتحدث حدث دة ودامك

})


})


//  فانا بنحدد اتصال المستخدم حالي اللى هو فاتح تطبيق مش بنحدد اسم يوسير من ايدي لاء بنحدد المستخدم متصل حالا بالتطبيق ومتصل بسيرفر حالا عشان كدة كل مستخدم متصل بسيرفر لهو ايدي 

// بالمناسبة فونشين دة بيرجع كدة بص تحتك

// socket دة بارميتر جاي من عندي انا ممكن تسمية اي اسم لكن الايدي دة جاي من مكتبة سوكيت لانها بترجعلك اوبجكيت بعد ما تعمل فونشين اتصال دة وقيم تانية



///////////////////////////////////////////////////////////////////////////////////////////////////////////////


server.listen(port , ()=> {

console.log("Server is running")

// هنا ربطوة بسيرفر عشان خاطر انا كريت فوق سيرفر قولتلوة سيرفر دة يربطوة ب اببب لان هي مسئؤلة عن بورت بقولوة كريتلي سيرفر لابلكيشن ابب وبعدها ربطها بقت مع سوكيت

// server لان هو كريتلي سيرفر مش io 

})


// تلؤتي احنا بنعمل شات دردشة طبعا لازم يكون شغال على طول  يعني سيرفر مفتوح مستخدم بعت رسالة لصحبوة توصلة فورا في ساعتها مش محتاج تعمل ريفريش هنا بقي لقينا مكتبة بتوفرلي كل دة وتمسك سيرفر وتغلي سيرفر شغال على طول انت بتبعت رسالة مش محتاج تعمل ريفريش كل شواية عشان تشوف مستخدم اخر بعتلك رسالة ولا لاء هنا مكتبة دي بقي بتوفر عنك كلام دة وتلغي ريفريش يعني مستخدم بعت رسالة تلؤتي توصلك فورا مش محتاج تعمل ريفريش اسم مكتبة تحت 


// socket.io دي مكتبة ببتعامل مع سيرفر اتشببب دي بتمسك سيرفر انت شغال علية وتخلي اتصال دائما مفتوح بتاع سيرفر بحيث مستخدم بعت رسالة لمستخدم اخر المستخدم اخر يشوفها على طول فورا من غير ما يعمل ريفريش


// http دي عبارة عن برتوكول بتنقل الرسائل والبيانات على انترنت بين سيرفر والبراويسير دة هنستخدمة مع مكتبة سوكيت لان مكتبة سوكيت بيتعامل مع السيرفر وليس اكسبريس دة بتستخدم محلي كمان وبتكون داتا مش متشفرة يعني ممكن ايدي يظهر فوق في شريط و دة مش حلو طبعا كأمان  

// https هو هو نفس شرح اللى فوق بس فكرة ان دة بحرف اس بيكون داتا متشفرة فوق في شريط عشان محدش يهكر بيانات او موقع و دي بتستخدم اكتر في نشر مواقع على نت وتكون داتا متشفرة


// socket.io محتاجين نعمل اعداد بتاعوة هنا ونظبطوة ونربطوة مع اكسبريس ونستدعي سيرفر اللى احنا نقدر نحط فيها ابلكيشن بتاع موقع بتاعنا ونستخدموة هنا لان سوكيت بيتعامل مع سيرفر وليس اكسبريس راوتير


// app.listen دة بيعمل سيرفر في مكتبة اكسبريس وهي خاصية موجودة في اكسبريس لانشاء سيرفرات بس مشكلة مش مسؤلة عن اتصالات طول وقت يعني محتاج ريجوسيت وريسبنوسيس يعني محتاج تبعت طلب ثم لسيرفر وتستنا الرد يرجعلك من سيرفر للمتصفح لكن سوكيت بيعمل عكس كدة السوكيت بيفتح اتصال مفتوح مش محتاج تستخدم ريجوسيت ورد وتستني رد سيرفر لاء السيرفر مفتوح دائما على براوزير السيرفر بعت حاجة على طول يوصل لبراوزير فورا مش محتاج تعمل طلب و رد و دة الفرق مابين سوكيت واكسبيريس ليثن

// app.listen الاتصال مش بيفضل دايما مفتوح يعني محتاج تبعت ريجوسيت و رد من سيرفر وتستني رد بتاع سيرفر يوصل للمتصفح بتاعك لكن سوكيت مختلف الادمن ضاف منتج على سيرفر جديد ويعرضوة على متصفح على طول يتعرض في ساعتها مش محتاج تعمل ريفريش كل مرة عشان تشوف تغييير  مش محتاج تعمل ريفريش لان سوكيت لغي موضوع دة وفتح الاتصال ما بين سيرفر والمتصفح يعني رسالة توصل في ساعتها من غير ريفريش


