


const User = require("../models/User")

const cloundinary = require("../config/cloundinary")

const asyncHandler = require("../middleware/asyncHandler")

const fs = require("fs")


const SearchUser = asyncHandler ( async( req , res ) => {


 const {username} = req.query // كويري دة بتاع شريط بحث فوق بيكتب في يو ار ال دة عايزين نجيب منة يوسير نيم عشان لو حد بحث علية   


const getUser = await User.find({ username : { $regex : username , $options:"i" }}).select("-password -tokens")

//  استخدمت فايند عشان هنا في شريط بحث هيرجع اكتر من يوسير احنا مش عايزينوة يرجع يوسير واحد فقط عشان كدة استخدمت فايند يرجعلنا اكتر من يوسير

//  {$regex : username  , $opitions : "i"} دور على اي اسم في بادي فية حروف دي اللى مستخدم كتبها وتعرضلوة في داتا بيز سواء كابتل او سمول سواء اول حرفين او تلاتة او اياكان يكون مطابق وقريب من نفس اسم

// سيليكت معناها رجعلي داتا كلها بتاع يوسير دة ماعدا باسورد وتوكينس مش هيعوزهم فروند اند في حاجة ولا مستخدم ومش يصح ان مستخدم يشوف توكين او باسورد مستخدم تاني ممكن يخش بتوكين بتاعة ويبقي كدة مش امان وكذلك باسورد


if(!getUser) {

res.status(400)

throw new Error("User not found")

}


res.status(200).json(getUser)


})


////////////////////////////////////////////////////////////////////////////////////////////////////////


const uploadAndUpdatePic = asyncHandler( async (req , res) => {


const userId = req.user.id  

// من الاخر الاتنين صح في كتابها مش هتفرق

// req.user._id دة صح لو كتبتها كدة بس الفكرة احنا بنكتبها كدة في حالة واحدة فقط لو هتجيب بيانات من داتا بيز الايدي بتاع منتج او عميل لازم تكتبها كدة
  
// req.user.id  كدة صح برضو لو كتبتها كدة لان جافاسكريبت بتتعامل معاها على انها نص سترينج مش رقم او نوع من انواع بيانات 


if(!req.file){

return res.status(400).json({ message : "you must choose a Image" })


// في حالة ان ميلتر مبعتش صورة والصورة مجتش ومفيش حاجة جت بقولوة اظهر رسالة للمستخدم ان هو يستحسن يختار صورة لهو

}


const getUser = await User.findById(userId)


// req.file الملف دة اللى جاي من ميلتر بعد ما المستخدم رفع صورة وميلتر حولك الصورة دي لملف جواها اوبجكيت فيها تفاصيل الصورة وبعتها لباك اند تمام هنا بقي ملف دة كدة كدة تلقائي كل حاجة فية بتتحذف بعد ما بتخلص الطلب بتاعك وتبعت رد يعني لما تخلص فونشين بتاعك وتبعت رد بتاعك كدة كدة تلقائي نودي جيس بيحذف ريجوسيت فايل دة كل حاجة فية الا حاجة واحدة فقط وهكتبها تحتيك 

// req.file.path دة السطر وحيد مش بيتحذف من ريجوسيت فايل لان مسار صورة دة متخزن في هارد ديسك وانت اللى خزنتوة عن طريق ميلتر هنا في راوتر في فولدر ابليوت عشان كدة وقولتلوة هناك في رواتر في ميلتر خزنلي صورة في الهارد ديسك طبيعي كل حاجة اتخزنت في هارد ديسك لكن فونشين هنا زاي مقولتلك بتقف ونودي جيس بيحذفوة تلقائي لما رد يوصل وتخلص فونشين بتاعك ماعدا المسار بتاع صورة لسة زاي ماهي محشورة جوة المصورة عشان كدة استخدمنا اف س وهو فايل سيستم عشان نحذف صورة و دي اداة الوحيدة تقدر تتعامل مع الهارد ديسك ومش اي اداة تاني تقدر تمسح صورة من هارد ديسك الا اداة دي 

// الميزة احنا عايزين نحذف مسار صورة زاي ما باقي اوبجكيت اتحذفوة مش عايزين نسيب أثر عشان كدة حذفتوة عن طريق فايل سيستم وهي بيلد ان بتساعدني على حذف اي حاجة متخزنة في هارد ديسك او في رام فهمت الفكرة ماشية ازاي 


if(!getUser){

 if(req.file) fs.unlinkSync(req.file.path) // طبيعي ريجوسيت فايل اتحذف من هارد ديسك اوبجكيت كلة ماعدا مسار الصورة متحذفش عشان كدة كلمت فايل سيتستم يخش يحذفوة في حالة لو مفيش مستخدم بعت صورة ولا مستخدم موجود ممكن يكون مستخدم رفع صورة وميلتر سيفها على هارد ديسك لكن مستخدم الايدي بتاع خلط او عمل لوج اويت وحذف حسابة او حسابة مش موجود في كل حالات دي صورة بتفضل مكانها في مسار دي داخل هارد ديسك بعد ما ريجوسيت فايل اتحذف عشان كدة استخدمنا فايل سيستم عشان نحذف مسار الصورة محشورة في هارد ديسك دي لان كدة كدة مستخدم رفع صورة في اوبجكيت ريجوسيت فايل نودي جيس بتحذفوة في حالة ان باك اند بعت رد والطلب خلص فهمني بس لكن مسار صورة بتفضل محشورة زاي ماهي عشان كدة بقولوة احذفها لو مستخدم دة مسجل عندنا قبل كدة ونزل صورة وعمل لوج اويت ومشي احذف صورة معاة بالمرة مسار  

 return res.status(400).json({message : "User is not found"})

}



if(getUser.profilePic.public_Id ){

 await cloundinary.uploader.destroy(getUser.profilePic.public_Id) // بقولوة لو مستخدم رافع صورة احذفها من كلويندري عشان بعد كدة لو حب يرفع صورة جديدة ويحدثها   

 // هيحذف صورة من كلويندري ويجيب الايدي بتاعها من داتا بيز

}


const result = await cloundinary.uploader.upload(req.file.path ,{

// بنحدد مسار صورة من ميلتر هنا ونقولوة مسار صورة جاي من ميلتر وحطها في فولدر اسمة افاتار تشات ع كليويندري

folder : "Avatars_Chat" ,

transformation : [{width :300 , height:300 , crop : "fill"}] // بقولوة خلي صورة صغيرة على كلويندري عشان يكون خفيف على سيرفر وقصها وخليها مربع الفكرة عملنا كدة عشان ساعات مستخدم بيخزن صور بيكون مساحتها كبيرة جدا على سيرفر وتقيلة جدا فقولتلوة خليلي صورة صغيرة وعلى شكل مربع على كلويندري حددتلوة حجم صورة يكون قد اية و دة مهم جدا عشان ميكون مساحة وحجم صورة كبيرة جدا على كليوندري وتيجي مستخدم يرفعها يلاقيها تقيلة او سيرفر تقيل بتاع كلويندري 
    
})

// خلاص بقي صورة اترفعت على كلويندري مش عايزها بقي تكون ليها اثر في ديسك عايزين نحذفها بقي من هارد ديسك طالما خلاص صورة رفعت على كلويندري امسحها على هارد ديسك عشان مياخدش مساحة


fs.unlinkSync(req.file.path)// مش عايزها في هارد ديسك احذفها خلاص رفعتها على كلويندري

getUser.profilePic.url = result.secure_url 


getUser.profilePic.public_Id = result.public_id


await getUser.save()


res.status(200).json({ message : "pic has added successfully" , ProfilePic : getUser.profilePic.url})

// ProfilePic هنا ممكن تكتب اي حاجة مفتاح مش شرط اسم محدد ممكن تسميها اي عشان فروند اند يعرف يوصل للصورة

})









module.exports = {SearchUser , uploadAndUpdatePic}