

const passPort = require("passport") 

const GooglePackge = require("passport-google-oauth20")

const GoogleStrategy = GooglePackge.Strategy 

// احنا بنجيب مكتبة اسمها بسبورد و دي مكتبة وسيطة نقدر نكلم بيها اي عملية تسجيل دخول للمستخدم تقدر تكلم بيها مكتبة جوجل او تكلم بيها مكتبة ياهو او مكتية جيميل هي بتوصلك ليهم وبتعمل اتصال مابين نودي جيس ومابين مكتبة جوجل او ياهو او جميمل اللى هتستخدموة 

// const GooglePackge = require("passport-google-oauth20") دي مكتبة جوجل اللى هنربطوة مع بسبورد عشان مستخدم يسجل دخول بيها


const User = require("../models/User")


// بنقولها نعمل طريقة تسجيل دخول ازاي ونربطها بجوجل ونجيب قيم جوجل اديهالنا عشان نستخدموه هنا

// بقولوة طريقة تسجيل دخول جوجل بربط مكتبين ببعض  

passPort.use(

new GoogleStrategy ({

   
  clientID : process.env.GOOGLE_CLIENT_ID ,

  clientSecret : process.env.GOOGLE_CLIENT_SECRET ,

  callbackURL : process.env.GOOGLE_CALLBACK_URL 


 
//   كتبنا هويتنا الايدي بتاع جوجل اللى اداهالي عشان يخليني يسمحلي اخزن بيانات مستخدم دة عندي في داتا بيز لو سجل دخول من على جوجل وكلينت سيكريت دة برضو رقم سري بينك وبين جوجل عشان محدش يعرفوة غيرك وتالت حاجة موقع او راوتر اللى جوجل هيروح علية ويخلي مستخدم يسجل دخول منة راوتر بتاعك اللى انت انشاءتوة في راوتر

},



// جوجل بتاخد اربع بارميتر دة ثابت واساسي بتبعت تصريح توكين دة مش هنستخدموة وبتبعت ريفريش للتوكين بنحدث توكين دة مش هنستخدموة وبنبعت بروفايل دة بقي هنستخدموة فية هوية مستخدم و دة هنخزنة عندنا وتالت دان وهو ان عملية نججت او فشلت يبعتلي رد على طول سواء نجح او ايرور

// اسامي بارميتر عادي مجرد اسامي انت ممكن تسميهم اي اسم بس اللى ثابت ومهم ان هما بياخدوة اربعة قيم يعني اربع بارميتر دة ثابت


async (sis , bro , profile , done ) => {

// asyncHandler دي بتتعامل فقط مع اكسبريس فقط اي ايرورر بيحصل في راوتير او في كونتلير بيروح علية على طول اكسبريس الفكرة انا عايز اوصلوهلك ان الايرورر هنا بيتعامل مع بسبورد مش مع اكسبريس بيتعامل مع نودي جيس ومعاة بسبورد مالوش علاقة باكسبريس عشان كدة استخدمنا تراي وكاتش لان اثنيك هناديلر ببتعامل مع اكسبريس فقط مالهاش علاقة بنودي جيس ولا بسبورد

// profile = {
//   displayName: "Bassem Ali",
//   emails: [{ value: "bassem@gmail.com" }],
//   photos: [{ value: "https://photo.google.com/bassem.jpg" }] دة بروفايل بارميتر بيرجع اوبجكيت زاي ماانت شوفت و دة اسم مستخدم ديسبلاي نيم اللى جاي من جوجل
// }


try{

let user = await User.findOne({email : profile.emails[0].value}) // هنا بيرجعلي اسم ايميل المستخدم اللى انا خزنتوة في جوجل عندي بنمسكوة ونتأكد منة عشان لو هو مسجل دخول قبل كدة منحفظش داتا بيز بتاع نفس مستخدم تاني وبروفايل دة براميتر بيرجع اوبجكيت جواة اوبجكيت دة في مصفوفة اسمها ايميلس جوجل عملها بتاع ايميلات جواها الايميل اللى هو فاليو كلمة فاليو دي اللى هي ايميل

if(user){

 return done(null , user) // بقولوة لو مستخدم موجود ومسجل دخول قبل كدة خلاص رجعلي بيانات مستخدم ومضيفهوش تاني اسمحلو بدخول على طول

}

else{

 user = await User.create({
  
  username : profile.displayName ,
  
  email : profile.emails[0].value ,  // هو طبيعي بيكون اول حاجة انديكس صفر وجوجل حطة ايميل في مصفوفة لان ممكن يكون اكتر من ايميل للمستخدمين كتير عشان كدة حطوة في مصفوفة لكن احنا عايزين اول انديكس فقط لان مستخدم واحد هيسجل عندنا فقط مش اتنين يسجلوة بنفس ايميل 

  password : null ,

 })


return done(null , user) // رجعلي داتا مستخدم وسيفها في داتا بيز 

}


}

catch(err){

return done(err , null) // رجعلي ايرورر ان يوسير مش موجود نال واعرضلي ايرورر

}



} 



))


module.exports = passPort